from ModelWrapper import ModelWrapper
import pickle as cucmber


ModelWrapper.CreateData()
ModelWrapper.TrainModel()

with open('logregmodel.pkl','rb') as f_input:
        model = cucmber.load(f_input) 
        
#just one house
print("Predicted= "+str(ModelWrapper().predict_logreg('طيلسان لابن حرب', model)))
print("TRUE= "+str(0))


#Wholw poem
testpoem='''
يا طُعمَ يا اِبنَ قُرَيطٍ إِنَّ بَيعَكُمُ
رِفدَ القِرى ناقِصٌ لِلدينِ وَالحَسَبِ
لَولا عِظامُ تَريفٍ ما غَفَرتُ لَكُم
يَومي بِأودَ وَلا أَنسَأتُكُم غَضَبي
قالوا اِشتَروا جَزَراً مِنّا فَقُلتُ لَهُم
بيعوا المَوالِيَ وَاِستَحيوا مِنَ العَرَبِ
'''
print("Predicted= "+str(ModelWrapper().predict_logreg(testpoem, model)))
print("TRUE= "+ str(0))


#just one house
print("Predicted= "+str(ModelWrapper().predict_logreg('يا شقيق الهلال في الظلمات', model)))
print("TRUE= "+str(1))


#Wholw poem
testpoem='''
سَأُضمِرُ وَجدي في فُؤادي وَأَكتُمُ
وَأَسهَرُ لَيلي وَالعَواذِلُ نُوَّمُ
وَأَطمَعُ مِن دَهري بِما لا أَنالُهُ
وَأَلزَمُ مِنهُ ذُلَّ مَن لَيسَ يَرحُمُ
وَأَرجو التَداني مِنكِ يا اِبنَةَ مالِكٍ
وَدونَ التَداني نارُ حَربٍ تَضَرَّمُ
فَمُنّي بِطَيفٍ مِن خَيالِكِ وَاِسأَلي
إِذا عادَ عَنّي كَيفَ باتَ المُتَيَّمُ
وَلا تَجزَعي إِن لَجَّ قَومُكِ في دَمي
فَما لِيَ بَعدَ الهَجرِ لَحمٌ وَلا دَمُ
أَلَم تَسمَعي نَوحَ الحَمائِمِ في الدُجى
فَمِن بَعضِ أَشجاني وَنَوحي تَعَلَّموا
وَلَم يَبقَ لي يا عَبلَ شَخصٌ مُعَرَّفٌ
سِوى كَبِدٍ حَرّى تَذوبُ فَأَسقَمُ
وَتِلكَ عِظامٌ بالِياتٌ وَأَضلُعٌ
عَلى جِلدِها جَيشُ الصُدودِ مُخَيِّمُ
وَإِن عُشتُ مِن بَعدِ الفُراقِ فَما أَنا
كَما أَدَّعي أَنّي بِعَبلَةَ مُغرَمُ
وَإِن نامَ جَفني كانَ نَومي عُلالَةً
أَقولُ لَعَلَّ الطَيفَ يَأتي يُسَلِّمُ
أَحِنُّ إِلى تِلكَ المَنازِلِ كُلَّما
غَدا طائِرٌ في أَيكَةٍ يَتَرَنَّمُ
بَكَيتُ مِنَ البَينِ المُشِتِّ وَإِنَّني
صَبورٌ عَلى طَعنِ القَنا لَو عَلِمتُم
'''
print("Predicted= "+str(ModelWrapper().predict_logreg(testpoem, model)))
print("TRUE= "+ str(1))

print(ModelWrapper.GetMeaning("كابوس"))

